/*
Задача 1. Наивная хэш-функция для строки
Вам нужно реализовать функцию, которая рассчитывает хэш для строки с помощью наивного алгоритма. Функция будет называться simple_string_hash.

Функция должна принимать на вход строку, а возвращать хэш этой функции — целое число. Наивный алгоритм вычисления хэша строки заключается в сложении кодов всех символов строки.

После написания функции её необходимо протестировать. Для этого организуйте работу с пользователем: просите его ввести строку и в ответ выводите на консоль значение хэша этой строки, посчитанного по реализованному вами алгоритму. Делайте это до тех пор, пока пользователь не введёт exit. Когда пользователь введёт exit, посчитайте хэш этой строки, выведите его на консоль и завершите работу программы.

Подумайте, какая сигнатура должна быть у функции simple_string_hash.

Пример работы программы
Введите строку: hello
Наивный хэш строки hello = 532
Введите строку: olleh
Наивный хэш строки olleh = 532
Введите строку: world
Наивный хэш строки world = 552
Введите строку: w
Наивный хэш строки w = 119
Введите строку: exit
Наивный хэш строки exit = 442
Подсказки
Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

Что использовать для решения.
Чтобы постоянно спрашивать у пользователя строки и обрабатывать их, нужно использовать цикл do...while и сравнение строк.

Так как ваша функция будет принимать строку и возвращать её хэш, то её сигнатура будет выглядеть так:

 int simple_string_hash(std::string s).

Так как строка состоит из символов, то для вычисления хэша нужно пробежаться по символам строки с помощью цикла for и сложить значение каждого символа в аккумулирующую переменную.
*/

#include <iostream>
#include <string>

using namespace std;

int simple_string_hash(string s) {
    int hash = 0;
    for (char c : s) {
        hash += static_cast<int>(c);
    }
    return hash;
}

int main() {
    setlocale(LC_ALL, "Russian");
    string input;
    do {
        cout << "Введите строку: ";
        getline(cin, input);
        
        int hash_value = simple_string_hash(input);
        cout << "Наивный хэш строки " << input << " = " << hash_value << endl;
        
    } while (input != "exit");
    
    return 0;
}