// Над проектом работали: DisForfeit, SimplyFozik
//==============================================================================
/*
  Задача 1. Вывод массива на экран
  Описание
  Напишите программу, которая создаёт массив целых чисел на 10 элементов и
  выводит на экран все элементы массива через запятую и пробел (,). Числа для
  заполнения массива придумайте сами.

  Пример работы программы
  1, 2, 3, 4, 5, 6, 7, 8, 9, 10
*/
//==============================================================================
/*
  Задача 2. Максимум и минимум
  Описание
  Напишите программу, которая создаёт массив целых чисел на 10 элементов,
  выводит на экран все элементы массива, находит минимальный и максимальный
  элементы массива и выводит их на экран. Числа для заполнения массива
  придумайте сами.

  Пример работы программы
  Массив: 1 2 3 4 5 6 7 8 9 10
  Минимальный элемент: 1
  Максимальный элемент: 10
*/
//==============================================================================
#include <iostream>

using namespace std;

void Zadacha_1() {
  cout << "===========================================" << endl;
  cout << "Программа выводит массив 10 целых чисел на\nэкран." << endl;
  cout << "===========================================" << endl;
  int mas[10]{10, 11, 12, 13, 14, 15, 16, 17, 18, 19};

  for (int i = 0; i < 10; i++) {
    if (i >= 0 && i < 9) {
      cout << mas[i] << ", ";
    } else {
      cout << mas[i] << endl;
      cout << "===========================================" << endl;
    }
  }
}
void Zadacha_2() {
  cout << "===========================================" << endl;
  int mas[10]{10, 11, 12, 13, 14, 15, 16, 17, 18, 19};
  int min = mas[0], max = mas[0];
  cout << "===============================================" << endl;
  cout << "Все элементы массива: " << endl;
  cout << "===============================================" << endl;
  for (int i = 0; i < 10; i++) {
    cout << "|" << mas[i];
  }
  cout << "|" << endl;
  for (int i = 0; i < 10; i++) {
    if (mas[i] < min) {
      min = mas[0];
    }
    if (mas[i] > max) {
      max = mas[i];
    }
  }
  cout << "===============================================" << endl;
  cout << "Минимальное значение: " << min << endl;
  cout << "Максимальное значение: " << max << endl;
  cout << "===============================================" << endl;
}

int main() {
  setlocale(LC_ALL, "Russian");
  int menu_in;
  cout << "===========================================" << endl;
  cout << "Данная программа содержит: Задача №1 и\nЗадача №2. Для выбора "
          "задачи используйте ввод\nеё номера: 1 или 2 и нажмите Enter"
       << endl;
  cout << "===========================================" << endl;
  cin >> menu_in;
  switch (menu_in) {
  case 1: // Задача №1
    Zadacha_1();
    break;
  case 2: // Задача №2
    Zadacha_2();
    break;
  default:
    break;
  }

  return 0;
}
