/*
Задание 2. Упорядочить числа
Напишите программу, которая запрашивает у пользователя три целых числа и выводит
их на экран в порядке убывания.

Пример
Введите первое число: 1
Введите второе число: -2
Введите третье число: 3

Результат: 3 1 -2
Ограничения*
Для решения задачи используйте только оператор ?:.
*/
#include <iostream>

using namespace std;

int main() {
  cout << "======================================" << endl;
  cout << "Программа | Упорядочить числа!" << endl;
  cout << "--------------------------------------" << endl;
  cout << "Правила: числа должны быть разные!" << endl;
  cout << "======================================" << endl;
  int a = 0, b = 0, c = 0;
  cout << "Введите первое число: ";
  cin >> a;
  cout << "Введите второе число: ";
  cin >> b;
  cout << "Введите третье число: ";
  cin >> c;

  cout << "======================================" << endl;
  cout << "Результат: " << endl;
  cout << "======================================" << endl;
  a > b &&a > c &&b > c
      ? cout << " | " << a << " | " << b << " | " << c << " | " << endl
  : a > b && a > c && c > b
      ? cout << " | " << a << " | " << c << " | " << b << " | " << endl
  : b > a && b > c && a > c
      ? cout << " | " << b << " | " << a << " | " << c << " | " << endl
  : b > a && b > c && c > a
      ? cout << " | " << b << " | " << c << " | " << a << " | " << endl
  : c > a && c > b && a > b
      ? cout << " | " << c << " | " << a << " | " << b << " | " << endl
  : c > a && c > b && b > a
      ? cout << " | " << c << " | " << b << " | " << a << " | " << endl
      : cout << "Ошибка программы!" << endl;
  cout << "======================================" << endl;
  return 0;
}
